In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("income.csv", names = ["Name", "Income"], skiprows = [0])
df

            Name  Income
0         Tesla     31.0
1           UBER    11.0
2         Amazon   386.0
3  Jindal  Steel     4.7
4      Axis Bank     5.6
5        Vedanta    11.3

In [3]:
df.describe()

           Income
count    6.000000
mean    74.933333
std    152.688646
min      4.700000
25%      6.950000
50%     11.150000
75%     26.075000
max    386.000000

In [7]:
df.Income.quantile(0.75)

26.075

In [8]:
df.Income.quantile(0.75, interpolation = 'lower')

11.3

In [9]:
df.Income.quantile(0.75, interpolation = 'higher')

31.0

In [10]:
df.Income.quantile(0)

4.7

In [11]:
df.Income.quantile(1)

386.0

In [12]:
df.Income.quantile(.99)

368.25000000000006

In [15]:
percentile_99 = df.Income.quantile(.99)
percentile_99

368.25000000000006

In [16]:
df[df.Income > percentile_99]

     Name  Income
2  Amazon   386.0

In [18]:
#No Outlier
df_no_outlier = df[df.Income <= percentile_99]
df_no_outlier

            Name  Income
0         Tesla     31.0
1           UBER    11.0
3  Jindal  Steel     4.7
4      Axis Bank     5.6
5        Vedanta    11.3

In [20]:
df

            Name  Income
0         Tesla     31.0
1           UBER    11.0
2         Amazon   386.0
3  Jindal  Steel     4.7
4      Axis Bank     5.6
5        Vedanta    11.3

In [25]:
df['Income'][3] = np.NaN

/var/folders/ht/fqs99t5d3499w838zzcdtgfm0000gn/T/ipykernel_2301/3431660905.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3] = np.NaN

In [26]:
df

            Name  Income
0         Tesla     31.0
1           UBER    11.0
2         Amazon   386.0
3  Jindal  Steel     NaN
4      Axis Bank     5.6
5        Vedanta    11.3

In [28]:
df.Income.mean()

88.98

In [31]:
df_new = df.fillna(df.Income.mean())
df_new

            Name  Income
0         Tesla    31.00
1           UBER   11.00
2         Amazon  386.00
3  Jindal  Steel   88.98
4      Axis Bank    5.60
5        Vedanta   11.30

In [32]:
df_new = df.fillna(df.Income.median())
df_new

            Name  Income
0         Tesla     31.0
1           UBER    11.0
2         Amazon   386.0
3  Jindal  Steel    11.3
4      Axis Bank     5.6
5        Vedanta    11.3